{
  "HOME": "ACCUEIL",
  "DOWNLOAD": "TÉLÉCHARGEMENT",
  "DOCUMENTATION": "DOCUMENTATION",
  "PROFESSIONAL_SERVICES": "SERVICE PRO",
  "FOOTER": "Gatling est un outil open source de test de charge utilisant <strong>Scala</strong>, <strong>Akka</strong> et <strong>Netty</strong>",
  "HOME_HEADER_TITLE": "est un outil open source de test de charge utilisant <strong>Scala</strong>, <strong>Akka</strong> et <strong>Netty</strong>",
  "HOME_HEADER_SUBTITLE1": "Haute performance",
  "HOME_HEADER_SUBTITLE2": "Des rapports clairs, exhaustifs et dynamiques",
  "HOME_HEADER_SUBTITLE3": "Un Recorder de scénarios et un DSL facile à prendre en main",
  "HOME_HEADER_SUBTITLE4": "\"Armez-vous pour la performance\"",
  "HOME_BANNER": "Passez&nbsp;à&nbsp;la&nbsp;vitesse&nbsp;supérieure avec&nbsp;nos&nbsp;services&nbsp;professionnels",
  "HOME_CAROUSEL_RECORD": "Enregistrez",
  "HOME_CAROUSEL_RECORD_CONTENT": "Avec votre propre navigateur, créez autant de scénarios que vous le souhaitez !<br/>Avec le Recorder de Gatling, vous serez capable de simulez toutes les actions de l’utilisateur, et même son temps de réflexion.",
  "HOME_CAROUSEL_EDIT": "Editer",
  "HOME_CAROUSEL_EDIT_CONTENT": "Nous avons développé un DSL clair et concis, pour vous aider à personnaliser vos scénarios.<br/>Facile à lire, facile à rédiger, facile à prendre en main.",
  "HOME_CAROUSEL_LAUNCH": "Lancer",
  "HOME_CAROUSEL_LAUNCH_OS": "Système d’exploitation",
  "HOME_CAROUSEL_LAUNCH_BUILD_TOOL": "Outil de build",
  "HOME_CAROUSEL_LAUNCH_CONTINUOUS_INTEGRATION": "Intégration continue",
  "HOME_CAROUSEL_ANALYZE": "Analyser",
  "HOME_CAROUSEL_ANALYZE_CONTENT": "Gatling produit des rapports clairs, exhaustifs, dynamiques et soignés. <br/>Zoomer, dézoomer et analysez les problèmes de performance !",
  "HOME_USE_GATLING": "Ils utilisent Gatling",
  "HOME_NEWS_HAPPY_NEW_YEAR": "L’équipe Gatling vous souhaite une bonne année!",
  "HOME_NEWS_VERSION": "Gatling {{version}} est disponible!",
  "PRO_TITLE": "Services professionnels",
  "PRO_CONTACT": "Toutes les prestations de services sont réalisées par <strong>l’équipe de développement de Gatling</strong>. Contactez-nous sur",
  "PRO_SUPPORT_DURATION": "Durée",
  "PRO_SUPPORT_NB_TICKETS": "Nombre de tickets",
  "PRO_SUPPORT_MAX_RESP_TIME": "Temps de réponse maximum",
  "PRO_SUPPORT_PRIORITY": "Priorité",
  "PRO_SUPPORT_CONSULTING": "Consulting rédaction de scénarios",
  "PRO_SUPPORT_SILVER": "Argent",
  "PRO_SUPPORT_GOLD": "Or",
  "PRO_SUPPORT_PLATINUM": "Platine",
  "PRO_SUPPORT_SILVER_DURATION": "Un an",
  "PRO_SUPPORT_SILVER_NB_TICKETS": "Trois",
  "PRO_SUPPORT_SILVER_MAX_RESP_TIME": "Un jour ouvré",
  "PRO_SUPPORT_SILVER_PRIORITY": "élevé",
  "PRO_SUPPORT_SILVER_CONSULTING": "Une heure",
  "PRO_SUPPORT_GOLD_DURATION": "Un an",
  "PRO_SUPPORT_GOLD_NB_TICKETS": "Douze",
  "PRO_SUPPORT_GOLD_MAX_RESP_TIME": "Un jour ouvré",
  "PRO_SUPPORT_GOLD_PRIORITY": "Très élevé",
  "PRO_SUPPORT_GOLD_CONSULTING": "Trois heures",
  "PRO_SUPPORT_PLATINUM_DURATION": "Un an",
  "PRO_SUPPORT_PLATINUM_NB_TICKETS": "Illimité",
  "PRO_SUPPORT_PLATINUM_MAX_RESP_TIME": "Quatre heures ouvrées",
  "PRO_SUPPORT_PLATINUM_PRIORITY": "Urgent",
  "PRO_SUPPORT_PLATINUM_CONSULTING": "Six heures",
  "PRO_PERFORMANCE_PACKAGE": "Tests clés en main : faites certifier votre application",
  "PRO_PERFORMANCE_PACKAGE_CONTENT1": "Nous proposons des offres performance incluant <strong>toutes les étapes du test de charge, de la rédaction de scénarios au reporting en passant par le lancement des tests.</strong>",
  "PRO_PERFORMANCE_PACKAGE_CONTENT2": "Des sessions pratiques sont aussi inclues pour vos équipes de test.",
  "PRO_PERFORMANCE_PACKAGE_CONTENT3": "Contactez-nous pour plus d’informations :",
  "PRO_ON_QUOTE": "Services professionnels sur devis",
  "PRO_TRAINING": "Formation et Certification",
  "PRO_TRAINING_CONTENT1": "<strong>Pour débutants ou utilisateurs confirmés</strong>. Rejoignez le réseau Gatling grâce à nos certifications !",
  "PRO_TRAINING_CONTENT2": "Programme d’une journée de formation",
  "PRO_MIGRATION": "Migration de Gatling",
  "PRO_MIGRATION_CONTENT1": "<strong>Profitez de tout le potentiel de Gatling</strong> et migrez vers la dernière version ! <strong>Notre équipe de développement vous aide dans votre migration.</strong>",
  "PRO_DEV": "Développement spécifique",
  "PRO_DEV_CONTENT": "Travaillez avec <strong>les experts Gatling!</strong>",
  "PRO_GET_IN_TOUCH": "Une seule adresse pour nous contacter :",


  "KLM_TITLE": "KLM",
  "KLM_QUOTE": "Gatling aide KLM à passer d’un mode d’organisation par projets à <strong>l’intégration continue</strong>",
  "KLM_QUOTE_AUTHOR": "Consultant senior en test de performance @ KLM",
  "KLM_SUBTITLE_1": "Vue d'ensemble",
  "KLM_CONTENT_1": "<p>Gatling aide KLM à passer d’un mode d’organisation par projets à l’intégration continue en rendant possible l’intégration des tests de charge et de performance dans le processus d’intégration continue.</p><p>Conçu comme un outil pour développeurs s’intégrant parfaitement aux outils de développement utilisés chez KLM, Gatling a été rapidement adopté par les développeurs des équipes produit.</p><p>En intégrant les tests de performance à l’intégration continue, les équipes ont un feedback quotidien de la performance durant un rush, afin de détecter et résoudre les problèmes dès le début du processus de développement.</p>",
  "KLM_SUBTITLE_2": "L’Histoire",
  "KLM_CONTENT_2": "<p>Chez KLM, il y a plusieurs applications web qui sont cruciales pour notre métier. L’outil de réservation en ligne, par exemple, génère une part importante du chiffre d’affaires totale de la compagnie aérienne.</p><p>Les indisponibilités ou les mauvaises performances de cette application peuvent mener à une baisse inadmissible du chiffre d’affaires. Le fait que des passagers utilisent des applications avec de mauvaises performances, comme pour le check-in sur internet, peut provoquer de longues files d’attente à l’aéroport.</p><p>C’est pourquoi toutes les applications indispensables à notre métier sont testées de manière approfondie avant d’être mis en ligne. Les tests de performance fournissent aussi des données pour le dimensionnement nécessaire des machines.</p>",
  "KLM_SUBTITLE_3": "Accélérer la mise sur le marché et préserver la qualité",
  "KLM_CONTENT_3": "<p>Durant les dix dernières années, tous les tests de performance étaient réalisés par une équipe dédiée au test de performance, composée de cinq spécialistes, réalisant des tests pour une centaine de mises en ligne par an. Depuis 2014, KLM a changé son mode d’organisation par projets pour se convertir à l’intégration continue.</p><p>Un des objectifs est d’accélérer la mise sur le marché en augmentant le nombre de mises en ligne, tout en préservant la qualité.</p>",
  "KLM_SUBTITLE_4": "Une nouvelle approche",
  "KLM_CONTENT_4": "<p>Cet objectif nécessitait une nouvelle approche : le test de performance devait faire partie du cycle de livraison, par l’automatisation autant que possible de son exécution et de l’analyse des résultats de test. Aussi le test de performance devait-il être adopté par les équipes produit.</p><p>C’est ici que Gatling est entré en jeu. Gatling est un outil conçu pour les développeurs et s’intègre parfaitement avec les outils que nos développeurs utilisent chez KLM, comme Maven ou Bamboo.</p><p>Nous rédigeons les tests Gatling dans un environnement de développement intégré Scala comme IntelliJ ou Eclipse et nous les ajoutons au code source de l’application dans le gestionnaire de sources.</p>",
  "KLM_SUBTITLE_5": "Un feedback permanent durant le rush",
  "KLM_CONTENT_5": "<p>Lors de la réalisation de tests de performance, les métriques Gatling sont envoyées dans Graphite, avec les métriques du système d’exploitation et de la Java Virtual Machine des applications testées. Les résultats de test sont ensuite analysés et comparés automatiquement, en utilisant une application de tableau de bord développée en propre. Les tests Gatling peuvent être déclenchés depuis le cycle de développement, donnant un feedback permanent de la performance d’une application durant le rush.</p>",
  "KLM_SUBTITLE_6": "Gatling, l’outil de test de performance de référence chez KLM",
  "KLM_CONTENT_6": "<p>Durant les mois précédents, toutes les applications web principales ont migré leurs tests de performance vers Gatling, faisant de fait de Gatling l’outil de test de performance de référence chez KLM.</p>"
}